emacs/README.org
#+TITLE: Emacs Configuration
#+AUTHOR: t3mpt0n
#+OPTIONS: toc:2

* Introduction
This is the configutation to my Emacs, enjoy!

* Package Managers
** [[https://github.com/progfolio/elpaca][Elpaca]]
The package manager used for my configuration along with nix for the Emacs package itself

Requirements:
- Emacs >= 27.1
- Git

This will clone Elpaca to =user-emacs-directory/elpaca=
*** Installer
#+begin_src elisp :mkdirp yes :tangle ./early-init.el
(defvar elpaca-installer-version 0.5)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

*** Configuration
#+begin_src elisp :mkdirp yes :tangle ./early-init.el
(setq package-enable-at-startup nil)
(defvar t3mpt0n/font "FiraCode Nerd Font"
  "Font for Emacs")

(provide 'early-init)
;;early-init.el ends here
#+end_src
#+begin_src elisp :mkdirp yes :tangle ./modules/elpaca/config.el
(elpaca elpaca-use-package
   (elpaca-use-package-mode)
   (setq elpaca-use-package-by-default t
         use-package-always-ensure t))
(elpaca-wait)
#+end_src
Also, make sure that any =after-init-hook= or =emacs-startup-hook= is changed to =elpaca-after-init-hook=.

** [[https://github.com/NixOS/nix][Nix]]
Requirements:
- Nix Package Manager

My personal choice of package manager, however, *NOT* configured in elisp.
*** Setting up the emacs package itself
#+begin_src nix :tangle ./default.nix
  {
    self,
    pkgs,
    ...
  }: {
    imports = [
      ./lsp
    ];

    nixpkgs.overlays = [ (import self.inputs.emacs-overlay) ];

    environment.systemPackages = [
      (pkgs.emacsWithPackagesFromUsePackage {
        config = ./init.el;
        defaultInitFile = true;
        package = pkgs.emacs-pgtk;
        extraEmacsPackages = epkgs: with epkgs; [
          use-package # Install use-package to use in tandem w/ elpaca
          vterm # Avoid annoying 'vterm-module' error
        ];
        alwaysEnsure = true;
      })
      (pkgs.nerdfonts.override { fonts = [ "FiraCode" "Iosevka" "NerdFontsSymbolsOnly" ]; })
      pkgs.fira-code-symbols
    ];
  }
#+end_src

* User Interface
By default, Emacs looks like shit... let's fix that!
*** Some initial setup
#+begin_src elisp :tangle ./modules/UI.el
  (use-package emacs
    :elpaca nil
    :init
    (setq inhibit-startup-message t
          visible-bell t
          frame-resize-pixelwise t
          package-native-compile t)
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (menu-bar-mode -1)
    (global-prettify-symbols-mode 1)
    :hook
    (prog-mode . menu-bar--display-line-numbers-mode-relative)
    (org-mode . menu-bar--display-line-numbers-mode-relative)
    (find-file . (lambda () (set-face-attribute 'default nil :font t3mpt0n/font :height 148))))
#+end_src

*** Ligatures
Requirements:
- Fira Code ::
  - Fira Code Symbols
  - Emacs >= 28.1
- Non-Fira Code ::
  - Emacs >= 28.1

Like every zoomer, I like my ligatures :).
#+begin_src elisp :mkdirp yes :tangle ./modules/UI.el
  (if (and (= (string-search "FiraCode" t3mpt0n/font) 0) (> emacs-major-version 28))
        (use-package fira-code-mode
          :after emacs
          :hook prog-mode
          :custom (fira-code-mode-disabled-ligatures '("www" ":" "*" "x" "&&")))
    (use-package ligature
      :after emacs
      :config
      (ligature-set-ligatures 't '("www"))
      (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                           ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                           "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                           "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                           "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                           "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                           "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                           "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                           ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                           "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                           "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                           "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                           "\\\\" "://"))
      (global-ligature-mode t)))
(defun t3mpt0n/prog-mode/customligs ()
  "Custom Ligatures for prog-mode"
  (mapc (lambda (pair) (push pair prettify-symbols-alist))
        '(
          ("defun" . #x1d453)
          ("def" . #x1d453)
          ("or" . #x2228)
          ("&&" . #x2227)
          ("and" . #x2227)
          ("in" . #x2208)
          ("true" . #x22a5)
          ("false" . #x22a4)
          ("int" . #x2124)
          ("float" . #x211d)
          ("not" . #xac)
          ("from" . #x21a6)
          ("import" . #x21a7))))
#+end_src

*** Icons
Enable icons for later.
#+begin_src elisp :mkdirp yes :tangle ./modules/UI.el
  (use-package all-the-icons)
  (use-package all-the-icons-nerd-fonts :after all-the-icons)
  (use-package nerd-icons)
  (use-package nerd-icons-completion :after nerd-icons)
  (use-package emojify
    :hook (elpaca-after-init . global-emojify-mode))
#+end_src

*** Theme
**** Modeline
I like the modeline from Spacemacs.
#+begin_src elisp :tangle ./modules/UI.el
  (use-package spaceline
    :init
    (setq powerline-default-seperator nil
          spacemacs-theme-underline-parens t))

  (use-package spaceline-all-the-icons
    :after (all-the-icons all-the-icons-nerd-fonts))
#+end_src

**** DOOM
Doom Emacs has a great collection of themes and colors my modeline.
#+begin_src elisp :tangle ./modules/UI.el
  (use-package doom-themes
    :init
    (progn
      (load-theme 'doom-tomorrow-night t)
      (enable-theme 'doom-tomorrow-night)))

  (use-package doom-modeline
    :init (doom-modeline-mode 1))
#+end_src

*** Menus
Hodgepodge of menu stuff that's worked for me so far.
#+begin_src elisp :tangle ./modules/UI.el
  (use-package counsel
    :bind (
     ("M-x" . counsel-M-x)
     ("C-x b" . counsel-ibuffer)
     ("C-x C-f" . counsel-find-file)))

  (use-package prescient
    :config (setq prescient-persist-mode t))

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)))

  (use-package ivy-prescient
    :after counsel
    :config
    (ivy-prescient-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

  (use-package vertico
    :init
    (vertico-mode))

  (use-package savehist
    :elpaca nil
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :demand t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+end_src

*** Sway fix && Transparency
Fix emacs bugginess on Sway (for the most part).
#+begin_src elisp :mkdirp yes :tangle ./modules/UI.el
  (use-package shackle
    :demand t
    :config
    (setq frame-title-format '("%b — GNU Emacs [" (:eval (frame-parameter (selected-frame) 'window-id)) "]"))
    (add-to-list 'default-frame-alist '(alpha-background . 90)))

  (use-package sway
    :config
    (sway-socket-tracker-mode)
    (sway-undertaker-mode)
    (sway-x-focus-through-sway-mode))
#+end_src

* Startup
** Garbage Cleanup
Move backup files to one folder to save me writing an MLA format =.gitignore=.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (setq backup-directory-alist '(("" . "~/.cache/emacs/"))
        backup-by-copying t
        version-control t
        delete-old-backups t
        kept-new-versions 20
        kept-old-versions 5)
#+end_src

** Custom Functions
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (defun t3mpt0n/show-and-copy-buffer-path ()
    "Show and copy the full path to the current file in the minibuffer."
    (interactive)
    ;; list-buffers-directory is the variable set in dired buffers
    (let ((file-name (or (buffer-file-name) list-buffers-directory)))
      (if file-name
          (message (kill-new file-name))
        (error "Buffer not visiting a file"))))
#+end_src

