emacs/modules/startup.el
  (setq backup-directory-alist '("" . "~/.cache/emacs/")
        backup-by-copying t
        version-control t
        delete-old-backups t
        kept-new-versions 20
        kept-old-versions 5)

  (defun t3mpt0n/show-and-copy-buffer-path ()
    "Show and copy the full path to the current file in the minibuffer."
    (interactive)
    ;; list-buffers-directory is the variable set in dired buffers
    (let ((file-name (or (buffer-file-name) list-buffers-directory)))
      (if file-name
          (message (kill-new file-name))
        (error "Buffer not visiting a file"))))
