emacs/README.org
** Dashboard
I don't want to open a frame just to see an empty scratch buffer.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (use-package dashboard
    :hook
    (elpaca-after-init . dashboard-insert-startupify-lists)
    (elpaca-after-init . dashboard-initialize)

    :config
    (dashboard-setup-startup-hook)
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
          dashboard-items '((bookmarks . 7)
                            (agenda . 3)
                            (recents . 5))
          dashboard-banner-ascii "NIXMACS"
          dashboard-center-content t
          dashboard-set-init-info t
          dashboard-filter-agenda-entry 'dashboard-no-filter-agenda))
#+end_src

** Enable Keybindings
Useful for configuring keybindings later.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (use-package hydra)
  (use-package which-key
    :init
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-idle-delay 0.2
          which-key-allow-imprecise-window-fit t)
    (which-key-mode)
    :diminish
    which-key-mode)

  (use-package general
    :init
    (general-create-definer t3mpt0n/leader-keys
      :keymaps 'override
      :states '(normal visual)
      :prefix "SPC"
      :global-prefix "M-SPC")
    (winner-mode 1)

    :config
    (general-evil-setup t)
#+end_src

*** Some convinient keys
**** Use ESC and not C-g
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

**** Quits (SPC q)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "q" '(:which-key "Quits")
    "q q" '(save-buffers-kill-terminal :which-key "Save Buffers Kill Frame")
    "q 3" 'server-edit
    "q 5 0" '(delete-frame :which-key "Delete Frame")
    "q k" '(save-buffers-kill-emacs :which-key "Kill Daemon Gracefully"))
#+end_src

**** Buffers (SPC b)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "b" '(:which-key "Buffers")
    "b m" '(counsel-ibuffer :which-key "Switch to Another Buffer")
    "b c" '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
    "b b" '(ibuffer-list-buffers :which-key "List Buffers in Seperate Window")
    "b B" '(ibuffer :which-key "List Buffers in Same Window")
    "b d" '(kill-current-buffer :which-key "Kill Current Buffer")
    "b D" '(kill-buffer :which-key "Choose Which Buffer to Kill")
    "b l" '(next-buffer :which-key "Next Buffer")
    "b h" '(previous-buffer :which-key "Previous Buffer"))
#+end_src

**** Window Control w/ Evil & Winner (SPC w)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "w" '(:which-key "Windows")
    "w k" '(evil-window-delete :which-key "Close window")
    "w n" '(evil-window-new :which-key "New window")
    "w s" '(evil-window-split :which-key "Horizontal split window")
    "w v" '(evil-window-vsplit :which-key "Vertical split window")
    "w q" '(evil-quit :which-key "Quit Window")
    "w h" '(evil-window-left :which-key "Window left")
    "w j" '(evil-window-down :which-key "Window down")
    "w k" '(evil-window-up :which-key "Window up")
    "w l" '(evil-window-right :which-key "Window right")
    "w w" '(evil-window-next :which-key "Goto next window")
    "w >" '(evil-window-increase-width :which-key "Increase Width")
    "w <" '(evil-window-decrease-width :which-key "Decrease Width")
    "w +" '(evil-window-increase-height :which-key "Increase Height")
    "w -" '(evil-window-decrease-height :which-key "Decrease Height")
    "w <left>"  '(winner-undo :which-key "Winner undo")
    "w <right>" '(winner-redo :which-key "Winner redo"))
#+end_src

**** Files (SPC f)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "f"   '(:which-key "File")
    "f f" '(counsel-find-file :which-key "Find File")
    "f r" '(counsel-recentf :which-key "Recent Files")
    "f s" '(save-buffer :which-key "Save File")
    "f u" '(sudo-edit-find-file :which-key "Sudo Find File")
    "f y" '(t3mpt0n/show-and-copy-buffer-path :which-key "Yank File Path")
    "f C" '(copy-file :which-key "Copy file")
    "f D" '(delete-file :which-key "Delete file")
    "f R" '(rename-file :which-key "Rename file")
    "f S" '(write-file :which-key "Save File As...")
    "f U" '(sudo-edit :which-key "Sudo Edit File")
    "f b" '(byte-compile-file :which-key "Byte Compile File")
    "f r" '(counsel-recentf :which "Recent Files"))
#+end_src

**** Help (SPC h)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "h" '(:which-key "Help")
    "h v" '(describe-variable :which-key "Describe Variable")
    "h k" '(describe-key :which-key "Describe Key")
    "h f" '(describe-function :which-key "Describe Function"))
#+end_src

**** Misc. (SPC {varied})
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (t3mpt0n/leader-keys
    "SPC" '(counsel-M-x :which-key "M-x")
    "R 3" '((lambda () (interactive) (load-file "/etc/nixos/emacs/init.el")) :which-key "Reload Emacs Config")))
#+end_src

** Fix Tabs and other Stuff (Lunarix Mode)
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (setq custom-tab-width 2)
  (defun disable-tabs () (setq indent-tabs-mode nil))
  (defvar untabify-this-buffer)

  (defun tab-all ()
    "Tabify current buffer"
    (tabify (point-min) (point-max)))

  (defun untab-all ()
    "Untabify current buffer, unless `untabify-this-buffer' is nil."
    (and untabify-this-buffer (untabify (point-min) (point-max))))

  (define-minor-mode lunarix-mode
    "Untabify buffer on save." nil " untab" nil
    (make-variable-buffer-local 'untabify-this-buffer)
    (setq untabify-this-buffer (not (derived-mode-p 'makefile-mode)))
    (add-hook 'before-save-hook #'untab-all))

  (setq-default electric-indent-inhibit t)
  (setq-default evil-shift-width custom-tab-width)

  (use-package whitespace
    :elpaca nil
    :init
    (global-whitespace-mode -1)

    :config
    (setq whitespace-mode '(face tabs tab-mark trailing) ;; Visualize tabs as a pipe char = "|"
          whitespace-display-mappings '((tab-mark 9 [124 9] [92 9]))))
#+end_src

** EVIL -- Vim Keybindings
As much as I adore Emacs, it's default keybindings leave me with carpal tunnel.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (use-package undo-tree)
  (use-package evil
    :after undo-tree
    :init
    (setq evil-want-keybinding nil)
    (global-undo-tree-mode 1)

    :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-tree)
    (setq undo-tree-history-directory-alist '(("." . "~/.cache/emacs/undo-tree"))))

  (use-package evil-collection
    :after evil
    :init
    (evil-collection-init)

    :config
    (setq evil-collection-mode-list '(dashboard ibuffer dired)))

  (use-package evil-tutor :after evil)
#+end_src

** SUDO && TRAMP
Enable editing files over sudo and over SSH.
#+begin_src elisp :mkdirp yes :tangle ./modules/startup.el
  (use-package sudo-edit)

  (use-package tramp
    :elpaca nil
    :init
    (setq tramp-default-method "ssh"))
#+end_src

* Org-Mode
** Initial Setup
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package org
  :elpaca nil
  :hook (org-mode . org-indent-mode)
  :config
  (setq org-directory "~/Docs/Org"
        org-agenda-files '("Agenda.org")
        org-default-notes-file (expand-file-name "Notes.org" org-directory)
        org-log-done 'time
        org-journal-dir "~/Docs/Org/Journal"
        org-journal-date-format "%B %d, %Y (%A) "
        org-journal-file-format "%d-%m-%Y.org"
        org-hide-emphasis-markers t
        org-todo-keywords
        '((sequence
           "TODO(t!)" ; Initial Creation
           "DOING(g@)" ; WIP
           "HOMEWORK(h@)" ; Homework
           "EXAM(e@)"
           "WAIT(w@)" ; Pause Task (My Choice)
           "BLOCKED(b@)" ; Pause Task (Not My Choice)
           "REVIEW(r!)" ; Inspect or Share Time
           "|" ; Remaining Close Task
           "DONE(d@)" ; Normal Completion
           "CANCELED(c@)" ; Not Going to do it
           "DUPLICATE(p@)" ; Already did it
           ))
        org-src-preserve-indentation t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-src-tab-acts-natively t
        org-src-fontify-natively t
        org-confirm-babel-evaluate nil
        org-edit-src-content-indentation 0
        org-highlight-latex-and-related '(latex script entities))

  :custom
  (defun risky-local-variable-p (sym &optional _ignored) nil))

(use-package org-contrib :after org)
#+end_src

