emacs/modules/org.el
(use-package org
  :elpaca nil
  :hook (org-mode . org-indent-mode)
  :config
  (setq org-directory "~/Docs/Org"
        org-agenda-files '("Agenda.org")
        org-default-notes-file (expand-file-name "Notes.org" org-directory)
        org-log-done 'time
        org-journal-dir "~/Docs/Org/Journal"
        org-journal-date-format "%B %d, %Y (%A) "
        org-journal-file-format "%d-%m-%Y.org"
        org-hide-emphasis-markers t
        org-todo-keywords
        '((sequence
           "TODO(t!)" ; Initial Creation
           "DOING(g@)" ; WIP
           "HOMEWORK(h@)" ; Homework
           "EXAM(e@)"
           "WAIT(w@)" ; Pause Task (My Choice)
           "BLOCKED(b@)" ; Pause Task (Not My Choice)
           "REVIEW(r!)" ; Inspect or Share Time
           "|" ; Remaining Close Task
           "DONE(d@)" ; Normal Completion
           "CANCELED(c@)" ; Not Going to do it
           "DUPLICATE(p@)" ; Already did it
           ))
        org-src-preserve-indentation t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-src-tab-acts-natively t
        org-src-fontify-natively t
        org-confirm-babel-evaluate nil
        org-edit-src-content-indentation 0
        org-highlight-latex-and-related '(latex script entities))

  :custom
  (defun risky-local-variable-p (sym &optional _ignored) nil))

(use-package org-contrib :after org)
