emacs/README.org
** Org Roam
Great note-taking thing.
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package org-roam
  :after (org general)
  :custom
  (org-roam-directory "~/Docs/Org/Roam")
  (org-roam-completion-everywhere t)
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
          (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))

  :config
  (org-roam-setup)
  (general-def
    :states '(normal visual)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC"
    "o" '(:which-key "Org Mode")
    "o r" '(:which-key "Org Roam")
    "o r b" '(:which-key "Org Roam Buffer")
    "o r b t" '(org-roam-buffer-toggle :which-key "Open/Close Org Roam Buffer")
    "o r n" '(:which-key "Org Roam Node")
    "o r n f" '(org-roam-node-find :which-key "Find Org Roam Node")
    "o r n i" '(org-roam-node-insert :which-key "Insert Org Roam Node")
    "o r n I" '(org-roam-node-insert-immediate :which-key "Insert Org Roam Node No New Buffer")
    "o r u"   '(:which-key "Org Roam UI")
    "o r u o" '(org-roam-ui-open :which-key "Org Roam UI Open")))

(use-package org-roam-ui
  :after (org-roam general)
  :hook (org-roam-mode . org-roam-ui-mode)

  :config
  (general-def
    :states '(normal visual)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC"
    "o r u"   '(:which-key "Org Roam UI")
    "o r u o" '(org-roam-ui-open :which-key "Org Roam UI Open"))
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src

** Misc. Addons
*** TOC
Enable table of contents for exported Org files.
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Bullets
Pretty bullets for Org files.
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package org-bullets
  :after org
  :hook (org-mode . (lambda () org-bullets-mode 1)))
#+end_src

*** CDLaTeX
Get the best of both Org and LaTeX.
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package cdlatex)
#+end_src

*** Org Babel TMUX
Execute Org code blocks w/ TMUX.
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package ob-tmux
  ;; Install package automatically (optional)
  :ensure t
  :config
  (setq vterm-enable-manipulate-selection-data-by-osc52 t)
  :custom
  (org-babel-default-header-args:tmux
   '((:results . "silent")                  ;
     (:session . "default")                 ; The default tmux session to send code to
     (:socket  . nil)))                     ; The default tmux socket to communicate with
  ;; The tmux sessions are prefixed with the following string.
  ;; You can customize this if you like.
  (org-babel-tmux-session-prefix "ob-")
  ;; The terminal that will be used.
  ;; You can also customize the options passed to the terminal.
  ;; The default terminal is "gnome-terminal" with options "--".
  (org-babel-tmux-terminal (concat user-emacs-directory "ob-tmux-defterm.sh"))
  (org-babel-tmux-terminal-opts nil))
#+end_src

*** Org Alert
Like life-alert but on Org mode.
#+begin_src elisp :mkdirp yes :tangle ./modules/org.el
(use-package org-alert
  :after org
  :config
  (run-with-timer 0 (* 5 60) 'org-alert-enable)
  (setq alert-default-style 'libnotify
        org-alert-interval 100
        org-alert-notify-cutoff 15
        org-alert-after-event-cutoff 15))
#+end_src

* Media
Integrate EMMS & Elfeed to play YouTube videos from RSS.
** EMMS (Music, Movies)
EMMS is the best multimedia system available for Emacs.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
(use-package emms-info-mediainfo :after emms)
(use-package emms
  :after general
  :init
  (emms-all)
  (emms-default-players)

  :hook
  (emms-playlist-cleared . emms-player-mpd-clear)
  (emms-browser-mode . visual-line-mode)

  :config
  (general-def
    :keymaps 'override
    :states '(normal visual)
    :prefix "SPC"
    :global-prefix "M-SPC"
    "m" '(:which-key "EMMS")
    "m m" '(emms :which-key "Playlist Buffer")
    "m b" '(emms-smart-browse :which "Smart Browse")
    "m SPC" '(emms-pause :which-key "Pause Playback")
    "m h" '(emms-seek-backward :which-key "Seek 5 Seconds Back")
    "m l" '(emms-seek-forward :which-key "Seek 5 Seconds Forward")
    "m /" '(emms-seek-to :which-key "Seek Specific Point"))
  (setq emms-browser-covers 'emms-browser-cache-thumbnail
        emms-browser-thumbnail-directory '(expand-file-name "thumbnails" "~/.cache/emms/")
        emms-seek-seconds 5
        emms-info-asynchronously t
        emms-player-list '(emms-player-mpd emms-player-mpv)
        emms-info-functions '(emms-info-mpd emms-info-mediainfo)
#+end_src

*** MPD
EMMS can integrate with MPD pretty well.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
        emms-player-mpd-server-name "0.0.0.0"
        emms-player-mpd-server-port "6601"
        mpc-host "0.0.0.0:6601"
        emms-browser-covers 'emms-browser-cache-thumbnail
        emms-browser-thumbnail-directory "~/.cache/emms/thumbnails/")
  (emms-player-mpd-connect)
  (emms-player-mpd-update-all-reset-cache)
  (emms-player-set emms-player-mpd
                   'regex
                   (emms-player-simple-regexp
                    "mp3" "opus" "ogg" "flac" "wav" "m4a"))
  (general-def
    :keymaps 'override
    :states '(normal visual)
    :prefix "SPC"
    :global-prefix "M-SPC"
    "m H" '(emms-player-mpd-previous :which-key "Prev Song")
    "m L" '(emms-player-mpd-next :which-key "Next Song")
    "m +" '(mpc-volup :which-key "Volume +5")
    "m -" '(mpc-voldown :which-key "Volume -5"))

  (defun mpc-volup ()
    (interactive)
    (let* ((mpd_host emms-player-mpd-server-name)
           (mpd_port emms-player-mpd-server-port)
           (mpd_hostport (concat "mpc --host=" mpd_host " --port=" mpd_port)))
      (if (string-equal (shell-command-to-string mpd_hostport)  "MPD error: Connection refused
")
          (message "%s" "MPD not connected")
        (message "%s" (replace-regexp-in-string "\n" "" (format "%s" (shell-command-to-string (concat mpd_hostport " volume +5 | awk 'NR==3 { print $1\" \"$2 }' | sed 's/v/V/g'"))))))))

  (defun mpc-voldown ()
    (interactive)
    (let* ((mpd_host emms-player-mpd-server-name)
           (mpd_port emms-player-mpd-server-port)
           (mpd_hostport (concat "mpc --host=" mpd_host " --port=" mpd_port)))
      (if (string-equal (shell-command-to-string mpd_hostport)  "MPD error: Connection refused
")
          (message "%s" "MPD not connected")
        (message "%s" (replace-regexp-in-string "\n" "" (format "%s" (shell-command-to-string (concat mpd_hostport " volume -5 | awk 'NR==3 { print $1\" \"$2 }' | sed 's/v/V/g'"))))))))
#+end_src

*** MPV
EMMS can also play videos with MPV.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
  (emms-player-set emms-player-mpv
                   'regex
                   (rx (or (: "https://" (* nonl) "youtube.com" (* nonl))
                           (+ (? (or "https://" "http://"))
                              (* nonl)
                              (regexp (eval (emms-player-simple-regexp
                                             "mp4" "mov" "wmv" "avi" "webm" "flv" "mkv")))))))
  (defvar yt-video-quality "1440p")
  (defun t3mpt0n/emms-player-mpv-parameters ()
    (let* ((res yt-video-quality)
           (epmdp emms-player-mpv-parameters)
           (res2 (replace-regexp-in-string "\\b[0-9]+\\b" "\\0" res)))
      (setq emms-player-mpv-parameters `(,@epmdp ,(format "--ytdl-format=bestvideo[height<=%s]+bestaudio/best" res2)))))

  (defun t3mpt0n/yt-res-select ()
    (interactive)
    (let ((availres '("480p" "720p" "1080p" "1440p" "2160p")))
      (ivy-read "  Select Video Quality: " availres
                :action (lambda (quality)
                          (setq yt-video-quality quality)))))

  (defun t3mpt0n/get-yt-url (link)
    (let ((watch-id (cadr
                     (assoc "watch?v"
                            (url-parse-query-string
                             (substring
                              (url-filename
                               (url-generic-parse-url link))
                              1))))))
      (concat "https://www.youtube.com/watch?v=" watch-id)))

  (defun t3mpt0n/emms-cleanup-urls ()
    (interactive)
    (let ((keys-to-delete '()))
      (maphash (lambda (key value)
                 (when (eq (cdr (assoc 'type value)) 'url)
                   (add-to-list 'keys-to-delete key)))
               emms-cache-db)
      (dolist (key keys-to-delete)
        (remhash key emms-cache-db)))
    (setq emms-cache-dirty t))

  (t3mpt0n/emms-player-mpv-parameters))

#+end_src

** Elfeed (RSS)
Elfeed is a great RSS reader for Emacs.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
(use-package elfeed
  :after emms
  :hook (elfeed-show-mode . visual-line-mode)
  :config
  (advice-add #'elfeed-insert-html
              :around
              (lambda (fun &rest r)
                (let ((shr-use-fonts nil))
                  (apply fun r))))
  (setq elfeed-enclosure-default-dir (expand-file-name "~/Downloads"))
  (setq-default elfeed-search-filter "@2-weeks-ago -read +unread -junk")
  (evil-define-key 'normal elfeed-show-mode-map
    (kbd "J") 'elfeed-goodies/split-show-next
    (kbd "K") 'elfeed-goodies/split-show-prev
    (kbd "RET") 'elfeed-search-show-entry
    (kbd "q") 'elfeed-search-quit-window
    (kbd "Q") 'elfeed-kill-buffer
    (kbd "u") 'elfeed-update
    (kbd "P") 't3mpt0n/elfeed-play-emms-youtube
    (kbd "+") 't3mpt0n/elfeed-add-emms-youtube)
  (evil-define-key 'normal elfeed-search-mode-map
    (kbd "J") 'elfeed-goodies/split-show-next
    (kbd "K") 'elfeed-goodies/split-show-prev
    (kbd "RET") 'elfeed-search-show-entry
    (kbd "q") 'elfeed-search-quit-window
    (kbd "Q") 'elfeed-kill-buffer
    (kbd "u") 'elfeed-update)

  (defun t3mpt0n/elfeed-add-emms-youtube ()
    (interactive)
    (emms-add-elfeed elfeed-show-entry)
    (elfeed-tag elfeed-show-entry 'watched)
    (elfeed-show-refresh))

  (defun t3mpt0n/elfeed-play-emms-youtube ()
    (interactive)
    (emms-play-elfeed elfeed-show-entry)
    (elfeed-tag elfeed-show-entry 'watched)
    (elfeed-show-refresh))

  (with-eval-after-load 'emms
    (define-emms-source elfeed (entry)
                        (let ((track (emms-track
                                      'url (t3mpt0n/get-yt-url (elfeed-entry-link entry)))))
                          (emms-track-set track 'info-title (elfeed-entry-title entry))
                          (emms-playlist-insert-track track)))))
#+end_src

*** Goodies
Various minor enhancements to Elfeed.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
(use-package elfeed-goodies
  :after elfeed
  :init
  (elfeed-goodies/setup)

  :config
  (setq elfeed-goodies/entry-pane-size 0.5))
#+end_src


*** Feeds
**** Feeds in an Org File
Configure all my feeds in an Org file.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
(use-package elfeed-org
  :after elfeed
  :init
  (elfeed-org)

  :config
  (setq rmh-elfeed-org-files (list (expand-file-name "FEEDS.org" user-emacs-directory) (expand-file-name "Org/FEEDS.org" "~/Docs/"))))
#+end_src

**** Auto Tagging
Auto tag all my feed files.
#+begin_src elisp :mkdirp yes :tangle ./modules/media.el
(use-package elfeed-autotag
  :after elfeed
  :init
  (elfeed-autotag)
  (elfeed-apply-hooks-now)

  :config
  (setq elfeed-autotag-files rmh-elfeed-org-files))
#+end_src

* Programming
** Code Completion (Enabling Company)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package company
  :init
  (global-company-mode)

  :config
  (push 'company-files company-backends)
  (define-key company-mode-map [remap indent-for-tab-command] #'company-indent-or-complete-common))
#+end_src

** Syntax Highlighting (Tree Sitter)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package tree-sitter
  :init (global-tree-sitter-mode))

(use-package tree-sitter-langs :after tree-sitter)
(use-package tree-sitter-indent :after tree-sitter)
#+end_src

