emacs/modules/prgm.el
(use-package company
  :init
  (global-company-mode)

  :config
  (push 'company-files company-backends)
  (define-key company-mode-map [remap indent-for-tab-command] #'company-indent-or-complete-common))

(use-package tree-sitter
  :init (global-tree-sitter-mode))

(use-package tree-sitter-langs :after tree-sitter)
(use-package tree-sitter-indent :after tree-sitter)

(use-package flycheck
  :init
