emacs/README.org
** Error Checking (Enabling Flycheck)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package flycheck
  :init
  (global-flycheck-mode))

(use-package flycheck-color-mode-line
  :after flycheck
  :hook (flycheck-mode . flycheck-color-mode-line-mode))
(use-package flycheck-pos-tip :after flycheck)
#+end_src

** MaGit (Git Interface)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package magit
  :after general
  :config
  (general-def
    :states '(normal visual)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC"
    "g" '(:which-key "Magit")
    "g S" '(magit-status :which-key "Magit Status")
    "g s" '(:which-key "Staging")
    "g s f" '(magit-stage-file :which-key "Stage Current File")
    "g b" '(:which-key "Branch")
    "g b c" '(magit-branch-create :which-key "Create")
    "g b d" '(magit-branch-delete :which-key "Delete")
    "g c" '(magit-commit :which-key "Commit")))
#+end_src

** Parantheses (Smartparens)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package smartparens
  :init
  (smartparens-global-mode 1)
  (show-smartparens-global-mode 1))

(use-package rainbow-delimiters ;; Colorful Parantheses
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Code Snippets (YASnippet)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package yasnippet
  :config
  (setq yas-snippet-dirs '("~/Docs/YASnippet/snippets"))
  (yas-global-mode 1))
#+end_src

** Language Configurations (Eglot)
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package eglot
  :hook
  (prog-mode . lunarix-mode)
  (prog-mode . disable-tabs)
  (prog-mode . t3mpt0n/prog-mode/customligs)
  (eglot--managed-mode . (lambda () (flymake-mode -1)))

  :config
  (setq debug-on-error t
        eglot-workspace-configuration '())

  :custom (defalias 'eglot--major-mode 'eglot--major-modes))
#+end_src

The code below just imports all the LSP files:
#+begin_src nix :mkdirp yes :tangle ./lsp/default.nix
{
  ...
}: {
  imports = [
    ./bls.nix
    ./crystal.nix
    ./jedi.nix
    ./nil.nix
    ./ruby.nix
    ./typst.nix
  ];
}
#+end_src

Below is a comprehensive configuration of all the languages I currently use:
*** Nix
**** [[https://github.com/oxalica/nil][NIL]]
Add this to your =flake.nix= [NOTE: this block is not tangled]:
#+begin_src nix
inputs.nil = {
  url = "github:oxalica/nil";
  inputs.nixpkgs.follows = "nixpkgs";
}
#+end_src

And then install it:
#+begin_src nix :mkdirp yes :tangle ./lsp/nil.nix
{
  pkgs,
  lib,
  inputs,
  ...
}: {
  nixpkgs.overlays = [ inputs.nil.overlays.default ];
  environment.systemPackages = [
    pkgs.nil
  ];
}
#+end_src

**** Configuration
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package nix-mode
  :mode "\\.nix\\'"
  :interpreter "nix"
  :after (eglot smartparens tree-sitter tree-sitter-langs)
  :hook (nix-mode . eglot-ensure)

  :config
  (push '(nix-mode . ("nil")) eglot-server-programs)
  (setq eglot-workspace-configuration '(list (:nil (:formatting (:command ["nixpkgs-fmt"])
                                                     :nix (:binary "/run/current-system/sw/bin/nix"
                                                           :flake (:autoArchive t
                                                                   :autoEvalInputs t
                                                                   :nixpkgsInputName "nixpkgs")))))))
#+end_src

*** Emacs Lisp
Emacs is its own LSP so just push =company-elisp= to =company-backends= and configure general.
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package emacs
  :after (general company smartparens)
  :elpaca nil
  :config
  (push 'company-elisp company-backends)
  (sp-with-modes 'emacs-lisp-mode
    (sp-local-pair "'" nil :actions nil)
    (sp-local-pair "`" nil :actions nil))
  (general-def
    :states '(normal visual)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC"
    "e"   '(:which-key "Elisp")
    "e b" '(eval-buffer :which-key "Eval Elisp in Buffer")
    "e d" '(eval-defun :which-key "Eval Defun")
    "e e" '(eval-expression :which-key "Eval Elisp Expression")
    "e l" '(eval-last-sexp :which-key "Eval Last Expression")
    "e r" '(eval-region :which-key "Eval Region")))
#+end_src

*** Shell
**** [[https://github.com/bash-lsp/bash-language-server][Bash Language Server]]
Install bash-language-server to Nix.
#+begin_src nix :mkdirp yes :tangle ./lsp/bls.nix
{
  pkgs,
  ...
}: {
  environment.systemPackages = with pkgs; [
    nodePackages_latest.bash-language-server
  ];
}
#+end_src

**** Configuration
The config's also pretty simple:
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package sh-script
  :elpaca nil
  :after eglot
  :hook
  (sh-mode . eglot-ensure))
#+end_src

*** Python
**** Install [[https://github.com/davidhalter/jedi][Jedi]] && [[https://github.com/pylint-dev/pylint][Pylint]]
 will be our LSP and Pylint will be used for error checking.
#+begin_src nix :mkdirp yes :tangle ./lsp/jedi.nix
{
  pkgs,
  ...
}: {
  environment.systemPackages = with pkgs.python311Packages; [
    jedi
    jedi-language-server
    pylint
  ];
}
#+end_src

**** Initial Setup
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package python-mode
  :after eglot
  :hook
  (python-mode . eglot-ensure)

  :config
  (push '(python-mode . "jedi-language-server") eglot-server-programs))
#+end_src

**** Jedi
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package company-jedi
  :after company
  :init
  (push 'company-jedi company-backends))
#+end_src

*** Ruby
**** Install [[https://github.com/castwide/solargraph][Solargraph]]
#+begin_src nix :mkdirp yes :tangle ./lsp/ruby.nix
{
  pkgs,
  ...
}: {
  environment.systemPackages = with pkgs; [
    (ruby.withPackages (ru: with ru; [
      solargraph
    ]))
    rubocop
  ];
}
#+end_src

**** Configuration
Install robe for better ruby navigation.
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package robe
  :mode "\\.rb\\'"
  :interpreter "ruby"
  :after (eglot company)
  :hook
  (ruby-mode . robe-mode)
  (robe-mode . eglot-ensure)

  :config
  (push 'company-robe company-backends))
#+end_src

*** Crystal
Very similar to Ruby.
**** Install [[https://github.com/crystal-lang/crystal][Crystal]] & [[https://github.com/elbywan/crystalline][Crystalline]]
Crystalline is a currently in development LSP for Crystal.

***** First, we need to make a derivation...
For =src.sha256=, add =lib.fakeSha256= to it and then copy whatever the =got:= section of the error message spat out into it.
#+begin_src nix :mkdirp yes :tangle /etc/nixos/packages/crystalline/default.nix
{
  lib,
  stdenv,
  fetchurl,
  gzip,
  ...
}: stdenv.mkDerivation rec {
  pname = "crystalline";
  version = "0.10.0";
  src = fetchurl {
    url = "https://github.com/elbywan/${pname}/releases/download/v${version}/${pname}_x86_64-unknown-linux-musl.gz";
    sha256 = "sha256-FQhLmcgQJoIj6K1Vf6L0JknTe5lJGTX2F/WTg5Ktqrs=";
  };

  buildInputs = [ gzip ];
  unpackPhase = ''
    cp $src crystalline.gz
    gzip -d crystalline.gz
  '';

  installPhase = ''
    chmod u+x crystalline
    mkdir -p $out/bin
    cp -a crystalline $out/bin
  '';

  meta = with lib; {
    description = "A Language Server Protocol implementation for Crystal. 🔮";
    homepage = "https://github.com/elbywan/crystalline";
    license = licenses.mit;
    platforms = platforms.linux;
    maintainers = with maintainers; [ t3mpt0n ];
  };
}
#+end_src

Then, append this to wherever you call your packages [NOTE: this block is not tangled]:
#+begin_src nix
{
  pkgs,
  ...
}: with pkgs; rec {
  crystalline = callPackage ./wherever_crystalline_deriv_is {};
}
#+end_src

***** Installing the packages
#+begin_src nix :mkdirp yes :tangle ./lsp/crystal.nix
{
  self,
  pkgs,
  lib,
  ...
}: {
  environment.systemPackages = with pkgs; [
    self.outputs.packages.x86_64-linux.crystalline
    crystal
  ];
}
#+end_src

**** Configuration
Now that we have installed both packages let's configure them with eglot:
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package crystal-mode
  :after eglot
  :hook (crystal-mode . eglot-ensure)
  :config (push '(crystal-mode . ("crystalline")) eglot-server-programs))

(use-package flycheck-crystal :after crystal-mode)
(use-package inf-crystal :after crystal-mode)

(use-package ameba
  :after crystal-mode
  :init (flycheck-ameba-setup))
(use-package flycheck-ameba :after ameba)
#+end_src

*** Typst
Rust alternative to LaTeX.
Doesn't that well yet as Typst is a new language.
**** Installing [[https://github.com/typst/typst][Typst]]
#+begin_src nix :mkdirp yes :tangle ./lsp/typst.nix
{
  pkgs,
  ...
}: {
  environment.systemPackages = with pkgs; [
    typst
    typst-lsp
    typst-fmt
  ];
}
#+end_src

**** Configuration
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package typst-ts-mode
  :after (eglot tree-sitter tree-sitter-langs company)
  :mode "\\.typ\\'"
  :interpreter "typst"
  :hook (typst-ts-mode . eglot-ensure)
  :elpaca
  (
   :repo "https://git.sr.ht/~meow_king/typst-ts-mode"
   :branch "main"
   :protocol https
   :main "typst-ts-mode.el"
   :files (:defaults "highlight.compare.scm")
   )

  :config
  (push '(typst "https://github.com/uben0/tree-sitter-typst") treesit-language-source-alist)
  (push '(typst-ts-mode . ("typst-lsp")) eglot-server-programs))
#+end_src

*** Rust
**** Installing [[https://github.com/oxalica/rust-overlay][Rust Overlay]] && Rust Packages
#+begin_src nix :mkdirp yes :tangle ./lsp/rust.nix
{
  self,
  pkgs,
  ...
}: {
  nixpkgs.overlays = [ (import self.inputs.ru-ov.overlays.default) ];
  environment.systemPackages = with pkgs; [
    (rust-bin.stable.latest.default.override {
      extensions = [ "rust-src" ];
    })
    rust-analyzer-unwrapped
  ];
}
#+end_src

**** Configuration
#+begin_src elisp :mkdirp yes :tangle ./modules/prgm.el
(use-package rust-mode)
(use-package rustic
  :mode "\\.rs\\'"
  :after (rust-mode eglot)
  :hook (rustic-mode . eglot-ensure)

  :config
  (add-to-list 'major-mode-remap-alist '(rust-mode . rustic-mode))
  (setq rustic-lsp-client 'eglot))
#+end_src

* Dired
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
(use-package dired
  :after (general evil)
  :elpaca nil
  :ensure nil
  :demand nil
  :config
  (setq dired-listing-switches "-agho --group-directories-first"
        dired-recursive-copies 'top
        dired-recursive-deletes 'top
        dired-dwim-target t
        dired-auto-revert-buffer t)
  (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
  (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file)
  (evil-define-key 'normal dired-mode-map (kbd "RET") 'dired-open-file)
  (general-def
    :states '(normal visual)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC"
    "d" '(:which-key "Dired")
    "d d" '(dired :which-key "Open Dired")
    "d j" '(dired-jump :which "Jump to Current Buffer Dir")
    "d p" '(peep-dired :which "Peep Dired")))

  :custom
  (if (< emacs-major-version 28)
      (progn
        (require 'dired-x)
        (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
        (define-key dired-mode-map (kbd "^") (lambda () (interactive) (find-alternate-file ".."))))
    (progn
      (setq dired-kill-when-opening-new-dired-buffer t)))
#+end_src

** Icons for Dired
#+begin_src elisp :mkdirp yes :tangle ./modules/dired.el
(use-package nerd-icons-dired
  :after (dired nerd-icons)
  :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

